//====================================================================
//
// AI処理 (ai.h)
// Author : 後藤慎之助
//
//====================================================================
#ifndef _AI_H_
#define _AI_H_

//================================================
// インクルードファイル
//================================================
#include "main.h"
#include "player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//================================================
// クラス宣言
//================================================

// AIクラス
class CAi
{
public:
    CAi();
    ~CAi();

    typedef struct
    {
        bool bButtonA;
        bool bButtonX;
    }ButtonState;    // ボタンの入力情報

    void Update(void);						    // 更新処理
    static CAi * Create(CPlayer *pPlayer);		// インスタンス生成処理
    void Move(void);                            // 移動するかどうか
    bool Jump(void);                            // ジャンプするかどうか
    bool BaseAttack(void);                      // 基本的な攻撃をするかどうか

private:
    CPlayer *m_pPlayer;

    ButtonState m_buttonStateOld;   // 1F前のボタン入力情報
};

#endif