#pragma once
//=============================================================================
//
// リザルト処理 [result.h]
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//************************************************
// ヘッダファイルのインクルード
//************************************************
#include "main.h"
#include "mode.h"

//================================================
// クラス宣言
//================================================
class CResult : public CMode
{
public:
    CResult();
    ~CResult();
    HRESULT Init(void);
    void Uninit(void);
    void Update(void);

private:

};

#endif