//=============================================================================
//
// アウトライン処理 [outline.h]
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _OUTLINE_H_
#define _OUTLINE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "billboard.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// アウトラインクラス定義
//*****************************************************************************
class COutline :public CBillboard
{
public:

    COutline();
    ~COutline();
    HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);
    void Update(void);
    void Draw(void);
    void Uninit(void);
    static COutline * Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 rot, D3DXCOLOR col);

    void Unable(void) { m_bUse = false; }                        // 消す

private:
    bool m_bUse;        // 使用するかどうか
};
#endif
