//======================================================================================
//
// ÉvÉåÉCÉÑÅ[ÇÃïKéEãZÇÃèàóù (player_sp.cpp)
// Author : å„ì°êTîVèï
//
//======================================================================================

//========================
// ÉCÉìÉNÉãÅ[ÉhÉtÉ@ÉCÉã
//========================
#include "player.h"
#include "effect3d.h"

//=============================================================================
// ïKéEãZÇÃë≈ÇøÇæÇµèàóù
// Author : å„ì°êTîVèï
//=============================================================================
void CPlayer::EmitSpShot(void)
{
    // ïKéEãZÇ≤Ç∆ÇÃë≈ÇøÇæÇµèàóù
    switch (m_spShot)
    {
    case SP_SHOT_HEAL:
        SpHeal();
        break;
    default:

        break;
    }

    // ÉQÅ[ÉWëSè¡îÔ
    m_fSpGaugeCurrent = 0.0f;
}

//=============================================================================
// ïKéEãZ:âÒïúÇÃèàóù
// Author : å„ì°êTîVèï
//=============================================================================
void CPlayer::SpHeal(void)
{
    // íËã`
    const float HEAL_VALUE = 0.34f; // âÒïúäÑçá

    // âÒïú
    m_fLife += m_fDef * HEAL_VALUE;

    // âÒïúÇÃè„å¿
    if (m_fLife > m_fDef)
    {
        m_fLife = m_fDef;
    }

    // ÉGÉtÉFÉNÉgî≠ê∂
    CEffect3D::Emit(CEffectData::TYPE_HEAL, GetPos(), GetPos(), GetActiveCollisionSize().x);
}