//=============================================================================
//
// タイトル処理 [title.h]
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "mode.h"

//================================================
// マクロ定義
//================================================

// タイトルの管理フレーム
#define TITLE_SHOW_TIME 90    // タイトルを見せる最低保証時間
#define TITLE_MAX_TIME 1000   // タイトルのカウンタの最大時間

//================================================
// 前方宣言(不完全なクラスは、cppの方でヘッダを呼び出す)
//================================================
class CScene2D;

//================================================
// クラス宣言
//================================================
class CTitle : public CMode
{
public:

    // 炎の場所
    typedef enum
    {
        FIRE_POS_UP = 0,
        FIRE_POS_DOWN,
    }FIRE_POS;

    CTitle();
    ~CTitle();
    HRESULT Init(void);
    void Uninit(void);
    void Update(void);
    void EmitFire(FIRE_POS firePos);

private:
    int m_nCntTime;     // スタートを押すまでの時間
};

#endif