//=============================================================================
//
// モード処理 [mode.h]
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _MODE_H_
#define _MODE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

class CMode
{
public:
    CMode();
    virtual ~CMode();
    virtual HRESULT Init(void) = 0;
    virtual void Uninit(void) = 0;
    virtual void Update(void) = 0;
};

#endif